docs/leets/0583-Delete-Operation-for-Two-Strings.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0583. Delete Operation for Two Strings</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-06-08
</div>
<div id="content" class="content">
<header>
<h1 class="title">0583. Delete Operation for Two Strings</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7fc8ef5">Problem:</a></li>
<li><a href="#orgf3ee167">Solution Description:</a></li>
<li><a href="#org8a9f944">What is LCS?</a></li>
<li><a href="#org7da7bc7">Example:</a></li>
<li><a href="#org9e03b0c">Setup:</a></li>
</ul>
</div>
</nav>
<ol class="org-ol">
<li>Delete Operation for Two Strings</li>
</ol>
<p>
<a href="https://leetcode.com/submissions/detail/1282282457/">https://leetcode.com/submissions/detail/1282282457/</a>
</p>

<p>
I have just rediscovered this website with very well written explanations:
<a href="https://algo.monster/liteproblems/583">https://algo.monster/liteproblems/583</a>
</p>

<p>
My previous attempt was to ask ChatGPT to write a good explanation and give me the empty solution function with some tests I can run in Emacs.
At the end, I gave up and asked GPT to solve the problem: 
<a href="https://leetcode.com/submissions/detail/1282232629/">https://leetcode.com/submissions/detail/1282232629/</a>
</p>

<p>
The solution is somewhat reverse to the Algo Monster, with some parts that is challenging to understand, like at the end:
      const lcsLength = dp[m][n];
      return m + n - 2 * lcsLength;
So I like the content at Algo Monster more. 
</p>


<div id="outline-container-org7fc8ef5" class="outline-2">
<h2 id="org7fc8ef5">Problem:</h2>
<div class="outline-text-2" id="text-org7fc8ef5">
<p>
Given two words `word1` and `word2`, return the minimum number of steps required to make `word1` and `word2` the same. In each step, you can delete one character in either string.
</p>
</div>
</div>

<div id="outline-container-orgf3ee167" class="outline-2">
<h2 id="orgf3ee167">Solution Description:</h2>
<div class="outline-text-2" id="text-orgf3ee167">
<p>
To implement the solution, we need to find the length of the longest common subsequence (LCS) of the two words. The minimum number of deletions required to make the two strings equal will be the sum of the lengths of both strings minus twice the length of the LCS.
</p>
</div>
</div>

<div id="outline-container-org8a9f944" class="outline-2">
<h2 id="org8a9f944">What is LCS?</h2>
<div class="outline-text-2" id="text-org8a9f944">
<p>
The Longest Common Subsequence (LCS) is the longest sequence that appears in both given sequences in the same order but not necessarily consecutively. For example, the LCS of "sea" and "eat" is "ea", and the LCS of "abc" and "ac" is "ac".
</p>

<p>
The steps are as follows:
</p>
<ol class="org-ol">
<li>Use dynamic programming to find the LCS of `word1` and `word2`.</li>
<li>Calculate the minimum deletions required using the formula: `len(word1) + len(word2) - 2 * LCS<sub>length</sub>`.</li>
</ol>

<p>
<b><b>Time Complexity:</b></b> O(m * n), where m and n are the lengths of `word1` and `word2` respectively. This is because we need to fill a 2D DP table of size m * n.
<b><b>Space Complexity:</b></b> O(m * n), for storing the DP table.
</p>
</div>
</div>

<div id="outline-container-org7da7bc7" class="outline-2">
<h2 id="org7da7bc7">Example:</h2>
<div class="outline-text-2" id="text-org7da7bc7">
<p>
Consider `word1 = "sea"` and `word2 = "eat"`. The LCS of "sea" and "eat" is "ea", which has a length of 2. Therefore, the minimum number of deletions required is `3 + 3 - 2 * 2 = 2`.
</p>

<p>
**LCS Algorithm:
</p>

<p>
The LCS problem can be solved using dynamic programming. The idea is to build a 2D table `dp` where `dp[i][j]` represents the length of the LCS of the substrings `word1[0&#x2026;i-1]` and `word2[0&#x2026;j-1]`.
</p>

<p>
**Steps:
</p>

<ol class="org-ol">
<li>Initialize a 2D array `dp` of size (m+1) x (n+1), where `m` and `n` are the lengths of `word1` and `word2` respectively.</li>
<li>Iterate over each character in `word1` and `word2`.</li>
<li>If the characters match, `dp[i][j] = dp[i-1][j-1] + 1`.</li>
<li>If the characters do not match, `dp[i][j] = max(dp[i-1][j], dp[i][j-1])`.</li>
<li>The length of the LCS will be `dp[m][n]`.</li>
</ol>
</div>
</div>


<div id="outline-container-org9e03b0c" class="outline-2">
<h2 id="org9e03b0c">Setup:</h2>
<div class="outline-text-2" id="text-org9e03b0c">
<p>
The initial setup involves defining a function to find the LCS and then using it to calculate the minimum deletions. Below is the skeleton and test setup:
</p>

<div class="org-src-container">
<pre class="src src-js">/**
 * Find the minimum number of steps to make word1 and word2 the same.
 * @param {string} word1 - First word.
 * @param {string} word2 - Second word.
 * @return {number} - Minimum number of steps.
 */
function minDistance(word1, word2) {
    const m = word1.length;
    const n = word2.length;
    const dp = Array(m + 1).fill().map(() =&gt; Array(n + 1).fill(0));

    for (let i = 0; i &lt;= m; i++) {
        dp[i][0] = i;
    }

    for (let i = 0; i &lt;= n; i++) {
        dp[0][i] = i;
    }

    console.table(dp);


    // Build the dp table
    for (let i = 1; i &lt;= m; i++) {
        for (let j = 1; j &lt;= n; j++) {
            // console.log(`word1:`);
            // console.log(word1);
            // console.log(`${' '.repeat(i - 1)}^`);

            // console.log(`word2:`);
            // console.log(word2);
            // console.log(`${' '.repeat(j - 1)}^`);

            const equalChar = word1[i - 1] === word2[j - 1];
            // console.log(`equalChar = ${equalChar}`);

            if (equalChar) {
                dp[i][j] = dp[i - 1][j - 1];
            } else {
                dp[i][j] = 1 + Math.min(dp[i - 1][j], dp[i][j - 1]);
            }
            console.table(dp);
        }
    }

    return dp[m][n];
}

// Test cases
const testCases = [
    { word1: "sea", word2: "eat", expected: 2 },
    { word1: "leetcode", word2: "etco", expected: 4 },
    { word1: "abc", word2: "def", expected: 6 },
    { word1: "", word2: "a", expected: 1 },
    { word1: "a", word2: "", expected: 1 },
    { word1: "", word2: "", expected: 0 },
];

testCases.forEach((test, index) =&gt; {
    const result = minDistance(test.word1, test.word2);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
